# Imports

In [3]:
import pandas as pd
import numpy as np

# Tutorial 02 - Read Files and basic operations

Read

In [10]:
df = pd.read_csv("weather_data_02.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

List Columns

In [11]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

Numer of columns

In [12]:
rows, columns = df.shape
columns

4

Print some rows

In [13]:
df.head(2)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny

Print last rows

In [14]:
df.tail(1)

        day  temperature  windspeed  event
5  1/6/2017           31          2  Sunny

Print interval

In [15]:
df[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [16]:
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [17]:
df.temperature

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [18]:
df['event']

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [19]:
type(df['event'])

pandas.core.series.Series

In [20]:
df[['event', 'day','temperature']]

   event       day  temperature
0   Rain  1/1/2017           32
1  Sunny  1/2/2017           35
2   Snow  1/3/2017           28
3   Snow  1/4/2017           24
4   Rain  1/5/2017           32
5  Sunny  1/6/2017           31

In [21]:
df['temperature'].min()

24

In [22]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [23]:
df[df.temperature>=32]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
4  1/5/2017           32          4   Rain

In [24]:
df[df.temperature==df['temperature'].max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [25]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [26]:
df.set_index('day', inplace = True)

In [27]:
df.reset_index(inplace = True)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [28]:
df.set_index('event', inplace=True)
df

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Rain   1/5/2017           32          4
Sunny  1/6/2017           31          2

In [29]:
df.loc['Snow']

            day  temperature  windspeed
event
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7

# Tutorial 03 - Read Excel and create data Frame In Memory

In [32]:
df = pd.read_csv("weather_data03.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [34]:
df = pd.read_excel("weather_data03.xlsx", "Sheet1")
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow

In [35]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature':[32,35,28],
    'windspeed': [6,7,2],
    'event': ['Rain','Sunny','Snow']
}

In [36]:
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [37]:
weather_data = [
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',35,7,'Sunny'),
    ('1/3/2017',28,2,'Snow')
]

In [38]:
df = pd.DataFrame(weather_data, columns = ["day","temperature","windspeed","event"])
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [39]:
weather_data = [
    {'day':'1/1/2017','temperature':32,'windspeed':6,'event':'Rain'},
    {'day':'1/2/2017','temperature':35,'windspeed':7,'event':'Sunny'},
    {'day':'1/3/2017','temperature':28,'windspeed':2,'event':'Snow'}
]
df = pd.DataFrame(weather_data)

In [40]:
df

        day  event  temperature  windspeed
0  1/1/2017   Rain           32          6
1  1/2/2017  Sunny           35          7
2  1/3/2017   Snow           28          2

# Tutorial 04 - Writes Files

In [43]:
df = pd.read_csv("stock_data04.csv", na_values = {
    'eps':["not available", "n.a."],
    'revenue': ["not available", "n.a.", -1],
    'people': ["not available", "n.a."]
})
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [44]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [45]:
df.to_csv('new.csv', columns=['tickers', 'eps'])

In [46]:
def convert_peolpe_cell(cell):
    if cell == "n.a.":
        return 'sam walton'
    return cell

def convert_eps_cell(cell):
    if cell == "not available":
        return None
    return cell

In [47]:
df = pd.read_excel("stock_data04.xlsx", "Sheet1", converters= {
        'people': convert_peolpe_cell,
        'eps': convert_eps_cell
    })

In [48]:
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

In [49]:
df.to_excel("new.xlsx", sheet_name = 'stocks', startrow=1)

In [50]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845,65,64],
    'pe':[30.37,14.26,30.97],
    'eps': [27.82,4.61,2.12]
})

df_weather = pd.DataFrame({
    'day': ['1/1/2017','1/1/2017','1/1/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [51]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name = "stocks")
    df_weather.to_excel(writer, sheet_name = "weather")

# Tutorial 05 - Missing Data

In [52]:
df = pd.read_csv('weather_data05.csv', parse_dates=["day"])

In [53]:
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

In [54]:
df.set_index('day', inplace=True)

In [55]:
new_df = df.fillna(0)

In [56]:
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          0.0        9.0   Sunny
2017-01-05         28.0        0.0    Snow
2017-01-06          0.0        7.0       0
2017-01-07         32.0        0.0    Rain
2017-01-08          0.0        0.0   Sunny
2017-01-09          0.0        0.0       0
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [57]:
new_df = df.fillna({
    'temperature': 0,
    'windspeeed':0,
    'event': 'no event'
})

In [58]:
new_df

            temperature  windspeed     event
day
2017-01-01         32.0        6.0      Rain
2017-01-04          0.0        9.0     Sunny
2017-01-05         28.0        NaN      Snow
2017-01-06          0.0        7.0  no event
2017-01-07         32.0        NaN      Rain
2017-01-08          0.0        NaN     Sunny
2017-01-09          0.0        NaN  no event
2017-01-10         34.0        8.0    Cloudy
2017-01-11         40.0       12.0     Sunny

In [59]:
new_df = df.fillna(method="ffill", limit=1)

In [60]:
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         32.0        9.0   Sunny
2017-01-05         28.0        9.0    Snow
2017-01-06         28.0        7.0    Snow
2017-01-07         32.0        7.0    Rain
2017-01-08         32.0        NaN   Sunny
2017-01-09          NaN        NaN   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [61]:
new_df = df.interpolate()

In [62]:
new_df

            temperature  windspeed   event
day
2017-01-01    32.000000       6.00    Rain
2017-01-04    30.000000       9.00   Sunny
2017-01-05    28.000000       8.00    Snow
2017-01-06    30.000000       7.00     NaN
2017-01-07    32.000000       7.25    Rain
2017-01-08    32.666667       7.50   Sunny
2017-01-09    33.333333       7.75     NaN
2017-01-10    34.000000       8.00  Cloudy
2017-01-11    40.000000      12.00   Sunny

In [63]:
new_df = df.dropna(thresh=2)
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-07         32.0        NaN    Rain
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [64]:
dt = pd.date_range("01-01-2017","01-11-2017")
idx = pd.DatetimeIndex(dt)
df.reindex(idx)

            temperature  windspeed   event
2017-01-01         32.0        6.0    Rain
2017-01-02          NaN        NaN     NaN
2017-01-03          NaN        NaN     NaN
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-09          NaN        NaN     NaN
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

# Tutorial 06 - Handle Missing Data

In [7]:
df = pd.read_csv('weather_data06.csv')

In [8]:
new_df = df.replace({
            'temperature': -99999,
            'windspeed': -99999,
            'event': '0'
}, np.NaN)

In [9]:
df = pd.DataFrame({
    'score': ['exceptional', 'average', 'good', 'poor', 'average', 'exceptional'],
    'student': ['rob', 'maya', 'parthiv', 'tom', 'julia', 'erica']
})

In [10]:
df.replace(['poor', 'average', 'good', 'exceptional'],[1,2,3,4])

   score  student
0      4      rob
1      2     maya
2      3  parthiv
3      1      tom
4      2    julia
5      4    erica

# Tutorial 07 - Group By

In [ ]:
df = pd.read_csv('weather_by_cities07.csv')

# Tutorial 08 - Concat Dataframes

In [65]:
india_weather = pd.DataFrame({
                              "city":["mumbai", "delhi", "banglore"],
                              "temperature":[32,45,30],
                              "humidity": [80,60,78]
                            })

In [66]:
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [67]:
us_weather = pd.DataFrame({
                              "city":["new york", "chicago", "orlando"],
                              "temperature":[21,14,35],
                              "humidity": [68,65,75]
                            })

In [68]:
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [69]:
pd.concat([india_weather, us_weather])

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [70]:
pd.concat([india_weather, us_weather], ignore_index = True)

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [71]:
pd.concat([india_weather, us_weather], keys=["india", "us"])

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [73]:
df=pd.concat([india_weather, us_weather], keys=["india", "us"])
df.loc["us"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [74]:
temperature_df = pd.DataFrame({
    "city":["mumbai", "delhi", "bangalore"],
    "temperature": [32,45,30],
}, index=[0,1,2])

In [75]:
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [77]:
windspeed_df = pd.DataFrame({
    "city":["delhi", "mumbai"],
    "temperature": [7,12]
}, index=[1,0])
windspeed_df

     city  temperature
1   delhi            7
0  mumbai           12

In [78]:
pd.concat([temperature_df, windspeed_df], axis = 1)

        city  temperature    city  temperature
0     mumbai           32  mumbai         12.0
1      delhi           45   delhi          7.0
2  bangalore           30     NaN          NaN

In [79]:
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [80]:
s = pd.Series(["Humid", "Dry", "Rain"],name="event")

In [81]:
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [82]:
pd.concat([temperature_df,s], axis=1)

        city  temperature  event
0     mumbai           32  Humid
1      delhi           45    Dry
2  bangalore           30   Rain